cf/InformationRegisters/CurrencyExchangeRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>CurrencyExchangeRates</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NBPTableNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/CurrenciesAtServer/Ext/Module.bsl
Function GetExchangeRatesValueList(Val Currency, Val ValueStructure, Val GetTopX = 9) Export
	
	Query = New Query;
	Query.Text = "SELECT TOP " + Format(GetTopX,"NFD=0; NG=0") +"
	             |	CurrencyExchangeRates.ExchangeRate,
	             |	CurrencyExchangeRates.Period AS Period,
	             |	CurrencyExchangeRates.NBPTableNumber
	             |FROM
	             |	InformationRegister.CurrencyExchangeRates AS CurrencyExchangeRates
	             |WHERE
	             |	CurrencyExchangeRates.Currency = &Currency
	             |
	             |ORDER BY
	             |	Period DESC";
	
	Query.SetParameter("Currency", Currency);
	Selection = Query.Execute().Select();

	ExchangeRatesValueList = New ValueList;
	
	While Selection.Next() Do
		
		If ValueStructure = Undefined Then
			Value = Selection.ExchangeRate;
		Else
			Value = New Structure;
			For Each KeyAndValue In ValueStructure Do
				Value.Insert(KeyAndValue.Key);
			EndDo;	
			FillPropertyValues(Value,Selection);
		EndIf;	
		ExchangeRatesValueList.Add(Value, "" + Selection.ExchangeRate + " (" + Selection.Period + ")");
		
	EndDo;
	
	Return ExchangeRatesValueList;
	
EndFunction
